app/Controllers/LogRegController.php


                // Insert data into database
                $usersModel = new UsersModel();
                $usersModel->insert($insertData);
---
INSERT INTO `users` (`firstname`, `lastname`, `email`, `password`, `address`, `gender`, `contact_number`, `image`, `role`) VALUES ('Ellaine', 'Macaraig', 'ellainemacaraig12@gmail.com', '$2y$10$zTSIXQHmbh/5wRWhcwuNRuSTbVzkUo4ZawJSx/viNJ3ZyHY8bE8o2', 'Baco', 'Female', '096342312341', '1718420968_dd4c2aa4424282590333.png', 'User')

        public function check()
        {
            // Include form helper
            helper(['form']);

            // Set rules for form validation
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required|min_length[8]|regex_match[/^(?=.*[A-Za-z])(?=.*\d)(?=.*[\W_]).+$/]'
            ];

            if ($this->validate($rules)) {
                $model = new UsersModel();
                $email = $this->request->getVar('email');
                $password = $this->request->getVar('password');
                $data = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ellainemacaraig12@gmail.com'
 LIMIT 1